app/controllers/questions_controller.rb

  def index
    @questions = Question.all.order(created_at: :desc)
---
SELECT "questions".* FROM "questions"  ORDER BY "questions"."created_at" DESC

  def create
    @question = Question.new(question_params)
    if @question.save
---
INSERT INTO "questions" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def update
    @question = Question.find(params[:id])
    if @question.update(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 330]]
UPDATE "questions" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "questions"."id" = $4

  def destroy
    @question = Question.find(params[:id])
    @question.destroy
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 548]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 548]]